In [9]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('tempdb.sqlite') #выборка 365 элементов в БД
query = "SELECT humidity FROM Results WHERE humidity > 70 AND humidity < 95;"
#выбираем из таблицы влажность в интересующем диапазоне

df = pd.read_sql_query(query,conn)

for i in df['humidity']:
    print(i)

76.0
88.0
91.0
86.0
80.0
76.0
72.0

In [25]:
query2 = "SELECT * FROM Results WHERE humidity > 70 AND humidity < 95;"
#выберем все данные таблицы при которых влажность в необходимом диапазоне
df2 = pd.read_sql_query(query2,conn)
print(df2)

   temp_C  temp_K  temp_F  humidity
0    27.6  300.75   81.68      76.0
1    27.7  300.85   81.86      88.0
2    36.2  309.35   97.16      91.0
3    36.0  309.15   96.80      86.0
4    35.9  309.05   96.62      80.0
5    35.9  309.05   96.62      76.0
6    35.7  308.85   96.26      72.0

In [27]:
df2.head(3)

   temp_C  temp_K  temp_F  humidity
0    27.6  300.75   81.68      76.0
1    27.7  300.85   81.86      88.0
2    36.2  309.35   97.16      91.0

In [28]:
query3 = "SELECT temp_C, humidity FROM Results WHERE humidity > 70 AND humidity < 95;"
#выберем все данные temp_C при которых влажность в необходимом диапазоне
df3 = pd.read_sql_query(query3,conn)
print(df3)

   temp_C  humidity
0    27.6      76.0
1    27.7      88.0
2    36.2      91.0
3    36.0      86.0
4    35.9      80.0
5    35.9      76.0
6    35.7      72.0

In [50]:
hums = df3['humidity']
hums

0    78.0
1    90.0
2    93.0
3    88.0
4    82.0
5    78.0
6    74.0
Name: humidity, dtype: float64

In [51]:
hums+=2 #увеличим на 2 все значения влажности в данной серии, обращаясь к ним по индексу
hums

0    80.0
1    92.0
2    95.0
3    90.0
4    84.0
5    80.0
6    76.0
Name: humidity, dtype: float64

In [52]:
print(type(hums))

<class 'pandas.core.series.Series'>

In [40]:
df3.loc[:5] #метод .loc о индексам первые 5 строк
#loc  -   это индексный метод, означающий «получить позицию метки в этом индексе»

   temp_C  humidity
0    29.6      76.0
1    29.7      88.0
2    38.2      91.0
3    38.0      86.0
4    37.9      80.0
5    37.9      76.0

In [140]:
df2.loc[2]  #вызов строки по индексу (другого дата фрейма!!!!!!)

temp_C       36.20
temp_K      309.35
temp_F       97.16
humidity     91.00
Name: 2, dtype: float64

In [141]:
df2.columns

Index(['temp_C', 'temp_K', 'temp_F', 'humidity'], dtype='object')

In [142]:
df2.loc[2, "humidity"] #влажность во второй строке

91.0

#iloc работает на основе целочисленного позиционирования (порядковый номер строки, даже ели она имеет буквенный индекс). 
#Поэтому, неважно, что будем делать с индексами строк
#КОММЕНТЫ В ПАНДАХ ПЕРЕД ILOC НЕ ПИСАТЬ!!!!!!!!!!!!!!!!!!!

#	df.loc[row_indexer,column_indexer]
# s.loc[indexer]

In [143]:
 df2.iloc[0] #1 строка по индексу

temp_C       27.60
temp_K      300.75
temp_F       81.68
humidity     76.00
Name: 0, dtype: float64

In [144]:
 df2.iloc[-2:]  #последние 2 строки

   temp_C  temp_K  temp_F  humidity
5    35.9  309.05   96.62      76.0
6    35.7  308.85   96.26      72.0

In [145]:
df2.iloc[:, 2] # вызов столбца по индексу

0    81.68
1    81.86
2    97.16
3    96.80
4    96.62
5    96.62
6    96.26
Name: temp_F, dtype: float64

In [146]:
 df2.iloc[:4, :4] # выборка по пересечению

   temp_C  temp_K  temp_F  humidity
0    27.6  300.75   81.68      76.0
1    27.7  300.85   81.86      88.0
2    36.2  309.35   97.16      91.0
3    36.0  309.15   96.80      86.0

In [147]:
df4 = df2.T  #транспонирование индексов
df4

               0       1       2       3       4       5       6
temp_C     27.60   27.70   36.20   36.00   35.90   35.90   35.70
temp_K    300.75  300.85  309.35  309.15  309.05  309.05  308.85
temp_F     81.68   81.86   97.16   96.80   96.62   96.62   96.26
humidity   76.00   88.00   91.00   86.00   80.00   76.00   72.00

In [148]:
df2['temp_C'] > 0 #соответствие True / False

0    True
1    True
2    True
3    True
4    True
5    True
6    True
Name: temp_C, dtype: bool

In [149]:
df3['temp_C'] < 0

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: temp_C, dtype: bool

In [150]:
only_hot = df2.where(df2['temp_C'] > 30)
#only_hot.head()
only_hot

   temp_C  temp_K  temp_F  humidity
0     NaN     NaN     NaN       NaN
1     NaN     NaN     NaN       NaN
2    36.2  309.35   97.16      91.0
3    36.0  309.15   96.80      86.0
4    35.9  309.05   96.62      80.0
5    35.9  309.05   96.62      76.0
6    35.7  308.85   96.26      72.0

In [151]:
query4 = "SELECT * FROM Results WHERE humidity < 95;"
#выберем все данные таблицы при которых влажность в необходимом диапазоне, расширим диапазон
df5 = pd.read_sql_query(query4,conn)
print(df5)

    temp_C  temp_K  temp_F  humidity
0     27.4  300.55   81.32      49.0
1     27.3  300.45   81.14      49.0
2     27.3  300.45   81.14      49.0
3     27.4  300.55   81.32      52.0
4     27.4  300.55   81.32      58.0
..     ...     ...     ...       ...
59    32.3  305.45   90.14      44.0
60    32.1  305.25   89.78      45.0
61    32.1  305.25   89.78      45.0
62    32.1  305.25   89.78      45.0
63    32.0  305.15   89.60      45.0

[64 rows x 4 columns]

In [152]:
only_hot2 = df5.where(df5['temp_C'] > 30)
#only_hot.head()
only_hot2

    temp_C  temp_K  temp_F  humidity
0      NaN     NaN     NaN       NaN
1      NaN     NaN     NaN       NaN
2      NaN     NaN     NaN       NaN
3      NaN     NaN     NaN       NaN
4      NaN     NaN     NaN       NaN
..     ...     ...     ...       ...
59    32.3  305.45   90.14      44.0
60    32.1  305.25   89.78      45.0
61    32.1  305.25   89.78      45.0
62    32.1  305.25   89.78      45.0
63    32.0  305.15   89.60      45.0

[64 rows x 4 columns]

In [153]:
only_hot2['temp_C'].count()

55

In [154]:
df5['temp_C'].count()

64

In [155]:
only_hot_final = only_hot2.dropna()  #удаляем NAN  значения
only_hot_final.head()

    temp_C  temp_K  temp_F  humidity
9     36.2  309.35   97.16      91.0
10    36.0  309.15   96.80      86.0
11    35.9  309.05   96.62      80.0
12    35.9  309.05   96.62      76.0
13    35.7  308.85   96.26      72.0

In [156]:
len(only_hot_final)

55

In [157]:
type(only_hot_final)

pandas.core.frame.DataFrame

In [158]:
only_hot_final['temp_C'].unique() #ТОЛЬКО УНИКАЛЫ, БЕЗ ПОВТОРОВ

array([36.2, 36. , 35.9, 35.7, 35.6, 35.5, 35.4, 35.3, 35.2, 35.1, 34.9,
       34.8, 34.7, 34.5, 34.4, 34.3, 34.1, 33.9, 33.8, 33.7, 33.6, 33.4,
       33.3, 33.2, 33.1, 33. , 32.9, 32.8, 32.7, 32.6, 32.4, 32.3, 32.1,
       32. ])

In [159]:
rez=only_hot_final[only_hot_final['temp_C'] == 35.9]
rez.head()

    temp_C  temp_K  temp_F  humidity
11    35.9  309.05   96.62      80.0
12    35.9  309.05   96.62      76.0

In [164]:
#ВЫЧИСЛИМ ПРИ КАКОЙ ТЕМПЕРАТУРЕ БЫЛА МАКСИМАЛЬНАЯ ВЛАЖНОСТЬ В ДАННОЙ ВЫБОРКЕ
only_hot3 = df5.where(df5['humidity'] > 90)
only_hot3

    temp_C  temp_K  temp_F  humidity
0      NaN     NaN     NaN       NaN
1      NaN     NaN     NaN       NaN
2      NaN     NaN     NaN       NaN
3      NaN     NaN     NaN       NaN
4      NaN     NaN     NaN       NaN
..     ...     ...     ...       ...
59     NaN     NaN     NaN       NaN
60     NaN     NaN     NaN       NaN
61     NaN     NaN     NaN       NaN
62     NaN     NaN     NaN       NaN
63     NaN     NaN     NaN       NaN

[64 rows x 4 columns]

In [166]:
only_hot3_final = only_hot3.dropna()  #удаляем NAN  значения
only_hot3_final.head()

   temp_C  temp_K  temp_F  humidity
9    36.2  309.35   97.16      91.0

In [168]:
query5 = "SELECT * FROM Results ;"
#выберем все данные таблицы при которых влажность в необходимом диапазоне
df_all = pd.read_sql_query(query5,conn)
df_all

     temp_C  temp_K  temp_F  humidity
0      27.4  300.55   81.32      49.0
1      27.3  300.45   81.14      49.0
2      27.3  300.45   81.14      49.0
3      27.4  300.55   81.32      52.0
4      27.4  300.55   81.32      58.0
..      ...     ...     ...       ...
360    32.3  305.45   90.14      44.0
361    32.1  305.25   89.78      45.0
362    32.1  305.25   89.78      45.0
363    32.1  305.25   89.78      45.0
364    32.0  305.15   89.60      45.0

[365 rows x 4 columns]

In [181]:
#В ВСЕЙ БД МАКСИМАЛЬНАЯ ВЛАЖНОСТЬ
top_hot = df_all.where(df_all['humidity'] > 94)
top_hot_final = top_hot.dropna()  #удаляем NAN  значения
top_hot_final.head()

    temp_C  temp_K  temp_F  humidity
9     28.0  301.15   82.40      95.0
10    28.1  301.25   82.58      95.0
11    28.3  301.45   82.94      95.0
12    28.4  301.55   83.12      95.0
13    28.6  301.75   83.48      95.0

In [182]:
len(top_hot_final)

301

In [191]:
#В ВСЕЙ БД КАКАЯ ВЛАЖНОСТь ПРИ ТЕМПЕРАТУРЕ В ДИАПАЗОНЕ > 36.1
top_hum = df_all.where(df_all['temp_C'] > 36.1)
top_hum_final = top_hum.dropna()  #удаляем NAN  значения
top_hum_final.head()

     temp_C  temp_K  temp_F  humidity
182    36.2  309.35   97.16      95.0
184    36.2  309.35   97.16      95.0
185    36.2  309.35   97.16      95.0
186    36.2  309.35   97.16      95.0
187    36.2  309.35   97.16      95.0

In [192]:
len(top_hum_final)

128